ЕСКД/src/Catalogs/mega_Номенклатура/mega_Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>mega_Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидДетали</name>
    <type>
      <types>CatalogRef.mega_ВидыДеталей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМатериалаДетали</name>
    <type>
      <types>CatalogRef.mega_ВидыМатериалов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаПоКлассификатору</name>
    <type>
      <types>CatalogRef.mega_КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.mega_ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.mega_Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДетали</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолщинаДетали</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изображение</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.mega_ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйРесурс</name>
    <type>
      <types>CatalogRef.mega_ПроизводственныеРесурсы</types>
    </type>
  </attributes>
</mdclass:Catalog>

ЕСКД/src/Enums/mega_ТипыНоменклатуры/mega_ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>mega_ТипыНоменклатуры</name>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>Полуфабрикат</name>
  </enumValues>
  <enumValues>
    <name>Деталь</name>
  </enumValues>
  <enumValues>
    <name>ГотоваяПродукция</name>
  </enumValues>
  <enumValues>
    <name>Операция</name>
  </enumValues>
</mdclass:Enum>

ЕСКД/src/Catalogs/mega_Номенклатура/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		
		Возврат;
	КонецЕсли;

	Если Не ЭтоГруппа Тогда 
		
		Если ЭтоНовый()Тогда 
			
			ПоследнийКод = Справочники.mega_Номенклатура.ПолучитьПоследнийКод();
			КодДляШтрихкода = Формат(Число(ПоследнийКод) + 1, "ЧЦ=7; ЧДЦ=0; ЧГ=0");
		Иначе 
			
			КодДляШтрихкода = ЭтотОбъект.Код;
		КонецЕсли;
		
		
		Штрихкод = КодДляШтрихкода + mega_Штрихкодирование.КонтрольныйСимволEAN(КодДляШтрихкода, 8);
		
		Если ЭтотОбъект.ТипНоменклатуры = Перечисления.mega_ТипыНоменклатуры.Деталь Тогда
			
			СтруктураПараметров = Новый Структура();
			СтруктураПараметров.Вставить("ВидДетали", ЭтотОбъект.ВидДетали);
			СтруктураПараметров.Вставить("ВидМатериалаДетали", ЭтотОбъект.ВидМатериалаДетали);
			СтруктураПараметров.Вставить("ТолщинаДетали", ЭтотОбъект.ТолщинаДетали);
			СтруктураПараметров.Вставить("Штрихкод", Штрихкод);
			ЭтотОбъект.КодДетали = Справочники.mega_Номенклатура.СформироватьКодДетали(СтруктураПараметров);
			ЭтотОбъект.Наименование = Справочники.mega_Номенклатура.СформироватьНаименованиеДетали(СтруктураПараметров);
			
		Иначе
			
			ЭтотОбъект.ВидДетали = Неопределено;
			ЭтотОбъект.ВидМатериалаДетали = Неопределено;
			ЭтотОбъект.КодДетали = "";
			ЭтотОбъект.ТолщинаДетали = 1;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	Префикс = "8";
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЕдиницаИзмерения = Неопределено;
		
	Комментарий = "";
	НаименованиеПолное = "";
	Описание = ""; 
КонецПроцедуры
